# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.14-s082_1 on Sat Sep 20 12:17:34 IST 2025

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design fft8_f32_stream

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_false_path -from [get_ports rst_n]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_real[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {s_imag[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports s_valid]
set_input_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports rst_n]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_real[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports {m_imag[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports m_valid]
set_output_delay -clock [get_clocks clk] -add_delay 2.5 [get_ports s_ready]
set_wire_load_mode "enclosed"
